Revit 2027 API
RebarBarType.StandardHookBendDiameter Property
 Defines hook bend diameter for rebar whose style is standard
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StandardHookBendDiameter { get; set; }
Public Property StandardHookBendDiameter As Double
	Get
	Set
public:
property double StandardHookBendDiameter {
	double get ();
	void set (double value);
}
member StandardHookBendDiameter : float with get, set
Property Value
Double
 The hook bend diameter for rebar whose style is standard
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: the bend diameter standardHookBendDiam isn't between bar diameter and 99.0
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace